//
// Copyright (C) 1993-1996 Id Software, Inc.
// Copyright (C) 2016-2017 Alexey Khokholov (Nuke.YKT)
//
// This program is free software; you can redistribute it and/or
// modify it under the terms of the GNU General Public License
// as published by the Free Software Foundation; either version 2
// of the License, or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// DESCRIPTION:

// eventually, DS will be fixed to 0x3D00 or so. Then, these will all 
// become casted #define variable locations rather than linked variables.
// this will make it easier to build collections of function binaries, 
// export them to file and load them at runtime into EMS memory locations

#ifndef __M_NEAR_H__
#define __M_NEAR_H__


#include "dutils.h"

#include "am_map.h"
#include "m_memory.h"
#include "m_misc.h"
#include "d_event.h"
#include "d_ticcmd.h"
#include "st_lib.h"
#include "st_stuff.h"
#include "hu_lib.h"
#include "dmx.h"
#include "m_menu.h"
#include "wi_stuff.h"
#include "p_spec.h"
#include "p_local.h"
#include "z_zone.h"
#include "d_englsh.h"
#include "sounds.h"
#include "s_sound.h"

#define SAVESTRINGSIZE        24u



#define NUM_CACHE_LUMPS 4

#define NUM_TEXTURE_L1_CACHE_PAGES 8
#define NUM_SPRITE_L1_CACHE_PAGES 4

#define KEY_PGDN        (0x80+0x51)
#define KEY_HOME        (0x80+0x47)
#define KEY_END         (0x80+0x4f)

#define SC_RSHIFT       0x36
#define SC_LSHIFT       0x2a

extern boolean grmode;
// REGS stuff used for int calls

extern boolean novideo; // if true, stay in text mode for debugging
#define KBDQUESIZE 32

extern void (__interrupt __far_func *oldkeyboardisr) (void);
extern gamestate_t         oldgamestate;



#define BACKUPTICS		16
#define NUMKEYS         256 


 

extern boolean         	  timingdemo;             // if true, exit with report on completion 
extern boolean         	  noblit;                 // for comparative timing purposes 





extern boolean         singledemo;             // quit after playing a demo from cmdline 
extern boolean         precache;        // if true, load all graphics at start 
extern wbstartstruct_t wminfo;                 // parms for world map / intermission 
 
  
 
// 
// controls (have defaults) 
// 
extern uint8_t             key_right;
extern uint8_t             key_left;
extern uint8_t             key_up;
extern uint8_t             key_down;
extern uint8_t             key_strafeleft;
extern uint8_t             key_straferight;
extern uint8_t             key_fire;
extern uint8_t             key_use;
extern uint8_t             key_strafe;
extern uint8_t             key_speed;
extern uint8_t             mousebfire;
extern uint8_t             mousebstrafe;
extern uint8_t             mousebforward;

extern int8_t             turnheld;
extern boolean         mousearray[4]; 
extern boolean*        mousebuttons;




extern int16_t		myargc;
extern int8_t**		myargv;
extern uint8_t		usemouse;


extern int8_t __far*   defdemoname; 


// Now what?
#define NUM_CHEATS 17

// these get shifted by 2 in the functions, so pass them in pre-shifted.
#define CHEATID_BEHOLDV         0
#define CHEATID_BEHOLDS         4
#define CHEATID_BEHOLDI         8
#define CHEATID_BEHOLDR         12
#define CHEATID_BEHOLDA         16
#define CHEATID_BEHOLDL         20
#define CHEATID_BEHOLD          24
#define CHEATID_AUTOMAP         28
#define CHEATID_MUSIC           32
#define CHEATID_GODMODE         36
#define CHEATID_AMMOANDKEYS     40
#define CHEATID_AMMONOKEYS      44
#define CHEATID_NOCLIP          48
#define CHEATID_NOCLIPDOOM2     52
#define CHEATID_CHOPPERS        56
#define CHEATID_CHANGE_LEVEL    60
#define CHEATID_MAPPOS          64



extern int8_t     st_stuff_buf[ST_MSGWIDTH];


extern task HeadTask;
extern task MUSTask;

extern void( __interrupt __far_func *OldInt8)(void);
extern volatile uint16_t TaskServiceCount;

extern volatile int8_t TS_TimesInInterrupt;
extern int8_t TS_Installed;
extern volatile int8_t TS_InInterrupt;

#define castorderoffset CC_ZOMBIE
 

#define    DI_EAST 0
#define    DI_NORTHEAST 1
#define    DI_NORTH 2
#define    DI_NORTHWEST 3
#define    DI_WEST 4
#define    DI_SOUTHWEST 5
#define    DI_SOUTH 6
#define    DI_SOUTHEAST 7
#define    DI_NODIR 8
#define    NUMDIRS 9
 
typedef int8_t dirtype_t;

typedef struct {

    boolean	istexture;
    uint8_t		numpics;
	uint16_t		picnum;
	uint16_t		basepic;
    
} p_spec_anim_t;



//
// ClipWallSegment
// Clips the given range of columns
// and includes it in the new clip list.
//
typedef	struct {

    int16_t	first;
	int16_t last;
    
} cliprange_t;


#define MAXSEGS		32
#define MAX_WADFILES 4



#ifdef DETAILED_BENCH_STATS
extern int32_t taskswitchcount;
extern int32_t texturepageswitchcount;
extern int32_t patchpageswitchcount;
extern int32_t compositepageswitchcount;
extern int32_t spritepageswitchcount;
extern int16_t benchtexturetype;
extern int32_t flatpageswitchcount;
extern int32_t scratchpageswitchcount;
extern int16_t spritecacheevictcount;
extern int16_t flatcacheevictcount;
extern int16_t patchcacheevictcount;
extern int16_t compositecacheevictcount;
extern int32_t visplaneswitchcount;

#endif





extern int8_t versionstring[12];

extern int8_t  currentoverlay;
extern int32_t codestartposition[NUM_OVERLAYS];

#if (EXE_VERSION >= EXE_VERSION_FINAL)
extern boolean    				plutonia;
extern boolean    				tnt;
#endif




#define MAX_MUSIC_CHANNELS	16		// total channels 0..CHANNELS-1
#define PERCUSSION	15		// percussion channel
#define MAX_INSTRUMENTS 175
#define MAX_INSTRUMENTS_PER_TRACK 0x1C // largest in doom1 or doom2
#define DEFAULT_PITCH_BEND 0x80
#define DEFAULT_VOLUME  256
#define MUTE_VOLUME  0


#define ADLIBPORT	0x388
#define SBPORT		0x228
#define SBPROPORT	0x220
#define OPL2PORT	0x388		/* universal port number */
#define OPL3PORT	0x388

#define OPL2CHANNELS	9
#define OPL3CHANNELS	18

/* DP_SINGLE_VOICE: param1 codes */
#define DPP_SINGLE_VOICE_OFF	0	/* default: off */
#define DPP_SINGLE_VOICE_ON	1


#define DRV_OPL2    0x01
#define DRV_OPL3	0x02

#define ST_EMPTY	0		// music block is empty
#define ST_STOPPED	1		// music block is used but not playing
#define ST_PLAYING	2		// music block is used and playing
#define ST_PAUSED	3		// music block is used and paused
					// any number >= 3 means `paused'
#define NUM_CONTROLLERS 10

 
#define DRV_SBMIDI	0x0005
#define SBMIDIPORT	0x220
#define MPU401PORT	0x330
#define DRV_MPU401	0x0004

/* Internal variables */
typedef struct {
	uint8_t	channelInstr[MAX_MUSIC_CHANNELS];		// instrument #
	uint8_t	channelVolume[MAX_MUSIC_CHANNELS];	// volume
	uint8_t	channelLastVolume[MAX_MUSIC_CHANNELS];	// last volume
	int8_t	channelPan[MAX_MUSIC_CHANNELS];		// pan, 0=normal
	int8_t	channelPitch[MAX_MUSIC_CHANNELS];		// pitch wheel, 0=normal
	uint8_t	channelSustain[MAX_MUSIC_CHANNELS];	// sustain pedal value
	uint8_t	channelModulation[MAX_MUSIC_CHANNELS];	// modulation pot value
} OPLdata;


typedef struct  {
	int8_t	(*initDriver)(void);    
	int8_t	(*detectHardware)(uint16_t port, uint8_t irq, uint8_t dma);
	int8_t	(*initHardware)(uint16_t port, uint8_t irq, uint8_t dma);
	int8_t	(*deinitHardware)(void);
	void	(*playNote)(uint8_t channel, uint8_t note, int8_t noteVolume);
	void	(*releaseNote)(uint8_t channel, uint8_t note);
	void	(*pitchWheel)(uint8_t channel, uint8_t pitch);
	void	(*changeControl)(uint8_t channel, uint8_t controller, uint8_t value);
	void	(*playMusic)();
	void	(*stopMusic)();
	void	(*pauseMusic)();
	void	(*resumeMusic)();
	void	(*changeSystemVolume)(uint8_t volume);
	int8_t	driverId;
	int8_t	unused;
	byte*   driverdata;

} driverBlock;


/* OPL2 instrument */
typedef struct{
/*00*/	uint8_t    trem_vibr_1;	/* OP 1: tremolo/vibrato/sustain/KSR/multi */
/*01*/	uint8_t	att_dec_1;	/* OP 1: attack rate/decay rate */
/*02*/	uint8_t	sust_rel_1;	/* OP 1: sustain level/release rate */
/*03*/	uint8_t	wave_1;		/* OP 1: waveform select */
/*04*/	uint8_t	scale_1;	/* OP 1: key scale lesvel */
/*05*/	uint8_t	level_1;	/* OP 1: output level */
/*06*/	uint8_t	feedback;	/* feedback/AM-FM (both operators) */
/*07*/	uint8_t trem_vibr_2;	/* OP 2: tremolo/vibrato/sustain/KSR/multi */
/*08*/	uint8_t	att_dec_2;	/* OP 2: attack rate/decay rate */
/*09*/	uint8_t	sust_rel_2;	/* OP 2: sustain level/release rate */
/*0A*/	uint8_t	wave_2;		/* OP 2: waveform select */
/*0B*/	uint8_t	scale_2;	/* OP 2: key scale level */
/*0C*/	uint8_t	level_2;	/* OP 2: output level */
/*0D*/	uint8_t	unused;
/*0E*/	int16_t	basenote;	/* base note offset */
} OPL2instrument;

/* OP2 instrument file entry */
typedef struct  {
/*00*/	uint16_t	    flags;			// see FL_xxx below
/*02*/	uint8_t	        finetune;		// finetune value for 2-voice sounds
/*03*/	uint8_t	        note;			// note # for fixed instruments
/*04*/	OPL2instrument  instr[2];	// instruments
} OP2instrEntry;

typedef struct  {
	// 00
	uint8_t	controllers[NUM_CONTROLLERS][MAX_MUSIC_CHANNELS]; // MUS controllers
	// a0
	uint8_t	channelLastVolume[MAX_MUSIC_CHANNELS];	// last volume
	// b0
	uint8_t	pitchWheel[MAX_MUSIC_CHANNELS];		// pitch wheel value
	// c0
	int8_t	realChannels[MAX_MUSIC_CHANNELS];		// real MIDI output channels
	// d0
	uint8_t	percussions[128/8];		// bit-map of used percussions
} MIDIdata;

/* OPL channel (voice) data */
typedef struct {
	uint8_t	channel;		/* MUS channel number */
	uint8_t	note;			/* note number */
	uint8_t	flags;			/* see CH_xxx below */
	uint8_t	realnote;		/* adjusted note number */
	uint8_t	pitchwheel;		/* pitch-wheel value */
	int8_t	finetune;		/* frequency fine-tune */
	int8_t  noteVolume;		/* note volume */
	int8_t	realvolume;		/* adjusted note volume */
	OPL2instrument _near * instr;	    /* current instrument */
	uint32_t time;			/* note start time */
}  AdlibChannelEntry;




