//
// Copyright (C) 1993-1996 Id Software, Inc.
// Copyright (C) 2016-2017 Alexey Khokholov (Nuke.YKT)
//
// This program is free software; you can redistribute it and/or
// modify it under the terms of the GNU General Public License
// as published by the Free Software Foundation; either version 2
// of the License, or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// DESCRIPTION:

// eventually, DS will be fixed to 0x3C00 or so. Then, these will all 
// become casted #define variable locations rather than linked variables.
// this will make it easier to build collections of function binaries, 
// export them to file and load them at runtime into EMS memory locations

#ifndef __M_NEAR_H__
#define __M_NEAR_H__


#include "dutils.h"

#include "am_map.h"
#include "m_memory.h"
#include "m_misc.h"
#include "d_event.h"
#include "d_ticcmd.h"
#include "st_lib.h"
#include "st_stuff.h"
#include "hu_lib.h"
#include "dmx.h"
#include "m_menu.h"
#include "wi_stuff.h"
#include "p_spec.h"
#include "p_local.h"
#include "z_zone.h"
#include "d_englsh.h"
#include "sounds.h"
#include "s_sound.h"

#define SAVESTRINGSIZE        24u



#define NUM_CACHE_LUMPS 4

#define NUM_TEXTURE_L1_CACHE_PAGES 8
#define NUM_SPRITE_L1_CACHE_PAGES 4

extern uint8_t		message_counter;



// offsets within segment stored
extern uint16_t hu_font[HU_FONTSIZE];





 

#if (EXE_VERSION >= EXE_VERSION_FINAL)
extern int16_t	p1text;
extern int16_t	p2text;
extern int16_t	p3text;
extern int16_t	p4text;
extern int16_t	p5text;
extern int16_t	p6text;

extern int16_t	t1text;
extern int16_t	t2text;
extern int16_t	t3text;
extern int16_t	t4text;
extern int16_t	t5text;
extern int16_t	t6text;
#endif


extern uint8_t  messageToPrint;
extern int8_t   menu_messageString[105];
extern int16_t  messageLastMenuActive;
extern boolean  messageNeedsInput;
extern void     (__near *messageRoutine)(int16_t response);
extern int16_t  saveStringEnter;
extern int16_t  saveSlot;       // which slot to save in
extern int16_t  saveCharIndex;  // which char we're editing
extern int8_t   saveOldString[SAVESTRINGSIZE];
extern int16_t  itemOn;                 // menu item skull is on
extern int16_t  skullAnimCounter;       // skull animation counter
extern int16_t  whichSkull;             // which skull to draw
extern int16_t  skullName[2];
extern menu_t   __near* currentMenu;      






extern menuitem_t MainMenu[6];
extern menu_t  MainDef;



extern menuitem_t EpisodeMenu[4];

extern menu_t  EpiDef;
//
// NEW GAME
//

extern menuitem_t NewGameMenu[5];
extern menu_t  NewDef;


extern menuitem_t OptionsMenu[8];
extern menu_t  OptionsDef;

//
// Read This! MENU 1 & 2
//

extern menuitem_t ReadMenu1[1];
extern menu_t  ReadDef1;


extern menuitem_t ReadMenu2[1];
extern menu_t  ReadDef2;

//
// SOUND VOLUME MENU
//

extern menuitem_t SoundMenu[4];
extern menu_t  SoundDef;
extern menuitem_t LoadMenu[6];
extern menu_t  LoadDef;
extern menuitem_t SaveMenu[6];
extern menu_t  SaveDef;
extern int8_t     menu_epi;


extern int8_t    detailNames[2];
extern int8_t    msgNames[2];




extern task HeadTask;
extern task MUSTask;

extern void( __interrupt __far_func *OldInt8)(void);
extern volatile fixed_t_union TaskServiceCount;

extern volatile int8_t TS_TimesInInterrupt;
extern int8_t TS_Installed;
extern volatile int8_t TS_InInterrupt;




#define castorderoffset CC_ZOMBIE
 

 

extern boolean  st_stopped;
extern uint16_t armsbgarray[1];



extern THINKERREF	activeplats[MAXPLATS];
extern weaponinfo_t	weaponinfo[NUMWEAPONS];
extern fixed_t		bulletslope;
extern uint16_t		switchlist[MAXSWITCHES * 2];
extern int16_t		numswitches;
extern button_t        buttonlist[MAXBUTTONS];
extern int16_t	maxammo[NUMAMMO];
extern int8_t	clipammo[NUMAMMO];
extern boolean		onground;


extern int16_t currentThinkerListHead;
extern mobj_t __near* setStateReturn;
extern mobj_pos_t __far* setStateReturn_pos;
extern uint16_t oldentertics;

   


#define    DI_EAST 0
#define    DI_NORTHEAST 1
#define    DI_NORTH 2
#define    DI_NORTHWEST 3
#define    DI_WEST 4
#define    DI_SOUTHWEST 5
#define    DI_SOUTH 6
#define    DI_SOUTHEAST 7
#define    DI_NODIR 8
#define    NUMDIRS 9
 
typedef int8_t dirtype_t;
extern dirtype_t opposite[9];
extern dirtype_t diags[4];



 



typedef struct {

    boolean	istexture;
	uint16_t		picnum;
	uint16_t		basepic;
    uint8_t		numpics;
    
} p_spec_anim_t;




#define MAXANIMS                32


extern p_spec_anim_t	anims[MAXANIMS];
extern p_spec_anim_t __near*		lastanim;
extern boolean		levelTimer;
extern ticcount_t		levelTimeCount;
extern int16_t		numlinespecials;








//
// ClipWallSegment
// Clips the given range of columns
// and includes it in the new clip list.
//
typedef	struct {

    int16_t	first;
	int16_t last;
    
} cliprange_t;


#define MAXSEGS		32
#define MAX_WADFILES 4


// newend is one past the last valid seg
extern cliprange_t __near*	newend;
extern cliprange_t	solidsegs[MAXSEGS];
extern uint16_t                     numlumps;
extern FILE*               		    wadfiles[MAX_WADFILES];
extern int16_t                	    filetolumpindex[MAX_WADFILES-1];
extern int32_t                		filetolumpsize[MAX_WADFILES-1];
extern int8_t                       currentloadedfileindex;
  







#if defined(__CHIPSET_BUILD)

// these are prepared for calls to outsw with autoincrementing ems register on
extern uint16_t pageswapargs[total_pages];

#else

extern int16_t emshandle;
extern int16_t pagenum9000;

extern uint16_t pageswapargs[total_pages];

#endif

  





#ifdef DETAILED_BENCH_STATS
extern int32_t taskswitchcount;
extern int32_t texturepageswitchcount;
extern int32_t patchpageswitchcount;
extern int32_t compositepageswitchcount;
extern int32_t spritepageswitchcount;
extern int16_t benchtexturetype;
extern int32_t flatpageswitchcount;
extern int32_t scratchpageswitchcount;
extern int16_t spritecacheevictcount;
extern int16_t flatcacheevictcount;
extern int16_t patchcacheevictcount;
extern int16_t compositecacheevictcount;
extern int32_t visplaneswitchcount;

#endif

extern int8_t currenttask;


extern segment_t			    spritewidths_segment;  // gross hack? todo revisit...


extern int8_t    savename[16];
extern int8_t versionstring[12];

extern int8_t  currentoverlay;
extern int32_t codestartposition[NUM_OVERLAYS];

#if (EXE_VERSION >= EXE_VERSION_FINAL)
extern boolean    				plutonia;
extern boolean    				tnt;
#endif




#define MAX_MUSIC_CHANNELS	16		// total channels 0..CHANNELS-1
#define PERCUSSION	15		// percussion channel
#define MAX_INSTRUMENTS 175
#define MAX_INSTRUMENTS_PER_TRACK 0x1C // largest in doom1 or doom2
#define DEFAULT_PITCH_BEND 0x80
#define DEFAULT_VOLUME  256
#define MUTE_VOLUME  0


#define ADLIBPORT	0x388
#define SBPORT		0x228
#define SBPROPORT	0x220
#define OPL2PORT	0x388		/* universal port number */
#define OPL3PORT	0x388

#define OPL2CHANNELS	9
#define OPL3CHANNELS	18

/* DP_SINGLE_VOICE: param1 codes */
#define DPP_SINGLE_VOICE_OFF	0	/* default: off */
#define DPP_SINGLE_VOICE_ON	1


#define DRV_OPL2    0x01
#define DRV_OPL3	0x02

#define ST_EMPTY	0		// music block is empty
#define ST_STOPPED	1		// music block is used but not playing
#define ST_PLAYING	2		// music block is used and playing
#define ST_PAUSED	3		// music block is used and paused
					// any number >= 3 means `paused'
#define NUM_CONTROLLERS 10

 
#define DRV_SBMIDI	0x0005
#define SBMIDIPORT	0x220
#define MPU401PORT	0x330
#define DRV_MPU401	0x0004

/* Internal variables */
typedef struct {
	uint8_t	channelInstr[MAX_MUSIC_CHANNELS];		// instrument #
	uint8_t	channelVolume[MAX_MUSIC_CHANNELS];	// volume
	uint8_t	channelLastVolume[MAX_MUSIC_CHANNELS];	// last volume
	int8_t	channelPan[MAX_MUSIC_CHANNELS];		// pan, 0=normal
	int8_t	channelPitch[MAX_MUSIC_CHANNELS];		// pitch wheel, 0=normal
	uint8_t	channelSustain[MAX_MUSIC_CHANNELS];	// sustain pedal value
	uint8_t	channelModulation[MAX_MUSIC_CHANNELS];	// modulation pot value
} OPLdata;


typedef struct  {
	int8_t	(*initDriver)(void);    
	int8_t	(*detectHardware)(uint16_t port, uint8_t irq, uint8_t dma);
	int8_t	(*initHardware)(uint16_t port, uint8_t irq, uint8_t dma);
	int8_t	(*deinitHardware)(void);
	void	(*playNote)(uint8_t channel, uint8_t note, int8_t noteVolume);
	void	(*releaseNote)(uint8_t channel, uint8_t note);
	void	(*pitchWheel)(uint8_t channel, uint8_t pitch);
	void	(*changeControl)(uint8_t channel, uint8_t controller, uint8_t value);
	void	(*playMusic)();
	void	(*stopMusic)();
	void	(*pauseMusic)();
	void	(*resumeMusic)();
	void	(*changeSystemVolume)(uint8_t volume);
	int8_t	driverId;
	int8_t	unused;
	byte*   driverdata;

} driverBlock;


/* OPL2 instrument */
typedef struct{
/*00*/	uint8_t    trem_vibr_1;	/* OP 1: tremolo/vibrato/sustain/KSR/multi */
/*01*/	uint8_t	att_dec_1;	/* OP 1: attack rate/decay rate */
/*02*/	uint8_t	sust_rel_1;	/* OP 1: sustain level/release rate */
/*03*/	uint8_t	wave_1;		/* OP 1: waveform select */
/*04*/	uint8_t	scale_1;	/* OP 1: key scale lesvel */
/*05*/	uint8_t	level_1;	/* OP 1: output level */
/*06*/	uint8_t	feedback;	/* feedback/AM-FM (both operators) */
/*07*/	uint8_t trem_vibr_2;	/* OP 2: tremolo/vibrato/sustain/KSR/multi */
/*08*/	uint8_t	att_dec_2;	/* OP 2: attack rate/decay rate */
/*09*/	uint8_t	sust_rel_2;	/* OP 2: sustain level/release rate */
/*0A*/	uint8_t	wave_2;		/* OP 2: waveform select */
/*0B*/	uint8_t	scale_2;	/* OP 2: key scale level */
/*0C*/	uint8_t	level_2;	/* OP 2: output level */
/*0D*/	uint8_t	unused;
/*0E*/	int16_t	basenote;	/* base note offset */
} OPL2instrument;

/* OP2 instrument file entry */
typedef struct  {
/*00*/	uint16_t	    flags;			// see FL_xxx below
/*02*/	uint8_t	        finetune;		// finetune value for 2-voice sounds
/*03*/	uint8_t	        note;			// note # for fixed instruments
/*04*/	OPL2instrument  instr[2];	// instruments
} OP2instrEntry;

typedef struct  {
	// 00
	uint8_t	controllers[NUM_CONTROLLERS][MAX_MUSIC_CHANNELS]; // MUS controllers
	// a0
	uint8_t	channelLastVolume[MAX_MUSIC_CHANNELS];	// last volume
	// b0
	uint8_t	pitchWheel[MAX_MUSIC_CHANNELS];		// pitch wheel value
	// c0
	int8_t	realChannels[MAX_MUSIC_CHANNELS];		// real MIDI output channels
	// d0
	uint8_t	percussions[128/8];		// bit-map of used percussions
} MIDIdata;

/* OPL channel (voice) data */
typedef struct {
	uint8_t	channel;		/* MUS channel number */
	uint8_t	note;			/* note number */
	uint8_t	flags;			/* see CH_xxx below */
	uint8_t	realnote;		/* adjusted note number */
	uint8_t	pitchwheel;		/* pitch-wheel value */
	int8_t	finetune;		/* frequency fine-tune */
	int8_t  noteVolume;		/* note volume */
	int8_t	realvolume;		/* adjusted note volume */
	OPL2instrument _near * instr;	    /* current instrument */
	uint32_t time;			/* note start time */
}  AdlibChannelEntry;





